{
  "useMockData": false,
  "jobDescription": "About the job\nAstoria AI (http://www.astoria.ai) is an early-stage startup focused on building human-centered global talent intelligence platform powered by Artificial Intelligence. At Astoria AI we believe that people have indispensable human need to realize their full potential. Our mission is to help people to unlock their potential and help organizations to attract those people and build sustained practices of retaining motivated and most qualified talent. \n\n \n\nJob Summary: \n\nWe are seeking a talented software developer with 6+ years of experience to join our team. The ideal candidate will be responsible for designing, developing, and maintaining software applications using variety of methods including conversational AI, vector search & embeddings, personalization and recommendation systems with ML/LLM-based tools and APIs. They will work closely with the product team to ensure that software applications are designed to meet user needs and business goals. \n\n \n\nCompensation includes equity shares until MVP launch and salary after. Become a part of our team and our success story. \n\n\n\nResponsibilities: \n\n- Develop software applications from scratch using LLM-based tools and APIs (both closed- and open-source) \n\n- Collaborate with other members of our dev team on building reliable and scalable data pipelines for the platform \n\n- Work with the product team to develop application features according to project scope and requirements \n\n- Test and debug software applications to ensure high-quality, reliable software \n\n- Continuously improve the performance and scalability of software applications \n\n- Stay up-to-date with emerging LLM-based tools, techniques, and technologies \n\n- Collaborate with other developers to integrate LLM-based tools into the software development process \n\n \n\nRequirements: \n\n- At least 6+ years of experience in software development, with recent focus on Prompt Engineering and LLM-based tools and APIs \n\n- Working knowledge of prompt programming (DSPy and other frameworks) \n\n- Bachelor's degree or higher in Computer Science or related field \n\n- Strong programming skills in Python, Typescript or Go \n\n- Experience with ChatGPT and other LLM-based tools, including pre-trained models and fine-tuning techniques \n\n- Familiarity with software development best practices, including version control, automated testing, and continuous integration/continuous deployment (CI/CD) \n\n- Excellent problem-solving skills and attention to detail \n\n- Ability to work independently and as part of a team in a quick-paced environment \n\n- Strong communication skills, both written and verbal \n\n \n\nProject experience requirements: \n\n- Proven ability and track record of building and deploying conversational AI systems (chatbots, virtual assistants) for multi-turn real-time user interactions \n\n- Experience in NLP, NLU, and NLG to handle complex user queries and provide intelligent, contextual responses \n\n- Knowledge of vector search and retrieval augmented generation (RAG) techniques to build graphs and search through vast amounts of user data \n\n \n\nIf you are a motivated and innovative developer who is passionate about leveraging LLM-based tools to create cutting-edge software applications, we would love to hear from you. This is an exciting opportunity to join a fast-growing startup and make a meaningful impact on the talent management industry. ",
  "companyProfile": "Overview\nAt Astoria AI we believe that people have indispensable human need to realize their full potential.\n\nOur mission is to help people find highest point of contribution and help organizations to attract those people and build sustained practices of retaining motivated and most qualified talent.\n\nWebsite\nhttps://www.astoria.ai/\nIndustry\nSoftware Development\nCompany size\n11-50 employees\n9 associated members LinkedIn members who've listed Astoria AI as their current workplace on their profile.\nHeadquarters\nNew York, New York\n\nDive Into the New Age of Talent Management AI\nHuman Centered AI\nTask for AI algorithms\nWhile old recruiting models and patchwork approach solutions have failed to resolve millennia-old recruiting problem, we are approaching the stage where unlocking human potential can become center task for AI algorithms.\n\nHuman side of the equation\nEven the most sophisticated technology can't solve this problem without one fundamental change. Placing the emphasis on the human side of the equation.\n\nDeep understanding of values and aspirations\nUnderstanding someone's values and aspirations leads to understanding their motivations and yields treasure trove of data that helps AI algorithms to unlock person's fullest potential and significantly improve recruiting.\n\nOur unique AI algorithm and platform\nUsing our platform will help you to recruit new employees and ensure your existing team members always at highest point of contribution.\n\n\nWe build sensitive and Human Centered AI Ecosystem\nIn the era of the Great Resignation, the companies best able to attract and retain talent will be those that deeply understand the needs of employees and offer benefits based on that knowledge.",
  "resume": "Contact\n1 (847) 630-3510 (Mobile)\ndiego.glusberg@gmail.com\nwww.linkedin.com/in/diegoglusberg-349a46a3 (LinkedIn)\nTop Skills\nOpenAI API\nArtificial Intelligence (AI)\nTypeScript\nDiego Glusberg\nFounding Full-Stack Engineer | Generative AI Builder | Ex-Practica\n(Acquired 2024)\nEvanston, Illinois, United States\nSummary\nFormerly a fine-dining chef, I was a founding engineer and the first\nhire at Practica, which was acquired by BetterUp in March 2024.\nAt Practica, I played a key role in creating a groundbreaking AI\ncareer coaching app. This non-linear, multi-agential system has\nempowered users to achieve their professional goals. I have\nextensive experience in prompt engineering for LLMs, and working\nwith AI in a full-stack capacity. I thrive in startup environments.\nWith a background that includes both strategic decision-making and\nhands-on technical work, I have collaborated closely with founders\nand stakeholders to ensure alignment with the company's vision\nand user needs. My contributions have laid a solid foundation for\ntechnological innovation and company growth. As a former chef,\nI bring a unique perspective to my work, always striving to create\ntechnology that genuinely improves people's lives. I am passionate\nabout taking on new challenges where I can leverage my expertise\nto contribute to meaningful projects with intensity and kindness.\nExperience\nPractica\nFounding Software Engineer\nJanuary 2021 - March 2024 (3 years 3 months)\nAcquired by BetterUp March 2024!\nAs a Founding Engineer and first hire at Practica, I have embraced the unique\nchallenges of a startup environment, supporting a coaching marketplace,\nthrough several different products leading to the creation of a pioneering AI\ncareer coaching app from its inception. My role has touched every aspect\nof the product development lifecycle, from the initial concept to the final\nimplementation. I have been deeply involved in both the strategic decisionPage 1 of 4making and the hands-on technical work required to bring our vision to life,\nestablishing a solid foundation for the company's growth and technological\ninnovation.\n- Architected and led the development of an AI career coaching app using\nGenerative AI and RAG, resulting in significant user engagement.\n- Collaborated closely with a developer and designer, streamlining workflows\nand reducing feature deployment time.\n- Architected and implemented a scalable full-stack solution with NextJS,\nReact, and Node, integrating vector and relational databases.\n- Played a strategic role in product direction, utilizing data analytics to inform\nfeature development.\ncheck out our TechCrunch coverage: https://techcrunch.com/2023/10/30/\nchatgpt-for-career-growth-practica-introduces-ai-based-career-coaching-andmentorship/\nCharlie Bird\nSous Chef\nApril 2019 - March 2020 (1 year)\nNew York, New York, United States\nLed a team of 10 in high-volume service, mastering efficiency and culinary\nexcellence, while managing inventory and fostering a flexible, fast-paced work\nenvironment.\nGramercy Tavern\nLine Cook (Saucier)\nMay 2016 - April 2019 (3 years)\nNew York, New York, United States\nMaintained and pushed forward Michelin Star standards of excellence,\nshowcasing adaptability and commitment to excellence across all stations,\nincluding prep and butchery. Leading team efforts in a demanding, highvolume setting.\nRestaurant August\nBackwaiter\nJuly 2015 - February 2016 (8 months)\nNew Orleans, Louisiana, United States\nPage 2 of 4Coordinated with front and back of house staff at a top New Orleans\nrestaurant, supervising food runners, resolving guest issues with creative\nsolutions, and contributing to high customer satisfaction through precise\nplating and expediting.\nDove's Luncheonette\nSous Chef\nNovember 2014 - July 2015 (9 months)\nChicago, Illinois, United States\nSupported the Executive Chef in managing a high-volume kitchen (up to 300\ncovers), ensuring top-quality output with meticulous attention to detail. Led\ntraining and supervision of kitchen staff on recipes and procedures, played a\nrole in menu planning, and effectively coordinated with front-of-house teams.\nOversaw inventory management and assisted with procurement.\nThe Winchester\nLine Cook\nJanuary 2014 - June 2014 (6 months)\nChicago, Illinois, United States\nPrepared diverse menus from scratch, ensuring high-quality output and\nsanitation standards across all meal services. Maintained equipment and\nstation organization for both hot and cold stations.\nOld World Food Truck\nCook\nNovember 2012 - December 2013 (1 year 2 months)\nSan Francisco, California, United States\nExecuted a rotating scratch menu with strict sanitation and quality. Handled\nfront-of-house operations and customer service. Managed on-site catering\nfor events up to 250 people and oversaw the truck's social media and web\npresence.\nIkes Love & Sandwiches\nAssociate\nSeptember 2011 - October 2012 (1 year 2 months)\nSan Francisco, California, United States\nVersatile role covering all kitchen duties in a high-volume setting, including\ntraining staff. Managed front-of-house operations to ensure excellent customer\nservice, and handled full-day operational responsibilities from open to close.\nPage 3 of 4Education\nWesleyan University\nBachelor's degree, Philosophy · (2007 - 2011)\nPage 4 of 4\n",
  "questions": [
    {
      "text": "Can you describe your experience with LLM-based tools and how you've applied them in your previous projects?",
      "assessment": "This question is asking about the candidate's experience with LLM-based tools and their ability to apply them in previous projects. It is assessing their knowledge and skills in this area."
    },
    {
      "text": "What strategies do you use for prompt engineering, and can you provide an example of a successful implementation?",
      "assessment": "This question is assessing the candidate's knowledge and skills in prompt engineering. It is asking them to explain their strategies and provide an example of a successful implementation."
    },
    {
      "text": "How do you ensure that the software applications you develop meet user needs and business goals?",
      "assessment": "This question is assessing the candidate's ability to ensure that the software applications they develop meet user needs and business goals. It is asking them to explain their strategies and provide examples of how they have achieved this in previous projects."
    },
    {
      "text": "Can you explain your experience with conversational AI systems and how you've built them for multi-turn interactions?",
      "assessment": "This question is assessing the candidate's experience with conversational AI systems and their ability to build them for multi-turn interactions. It is asking them to explain their strategies and provide examples of how they have achieved this in previous projects."
    },
    {
      "text": "What is your approach to testing and debugging software applications?",
      "assessment": "This question is assessing the candidate's approach to testing and debugging software applications. It is asking them to explain their strategies and provide examples of how they have achieved this in previous projects."
    },
    {
      "text": "How do you stay updated with emerging technologies in AI and software development?",
      "assessment": "This question is assessing the candidate's ability to stay updated with emerging technologies in AI and software development. It is asking them to explain their strategies and provide examples of how they have achieved this in previous projects."
    },
    {
      "text": "Can you discuss your experience with vector search and retrieval augmented generation (RAG) techniques?",
      "assessment": "This question is assessing the candidate's experience with vector search and retrieval augmented generation (RAG) techniques. It is asking them to explain their strategies and provide examples of how they have achieved this in previous projects."
    },
    {
      "text": "What programming languages are you most comfortable with, and how have you used them in your past projects?",
      "assessment": "This question is assessing the candidate's comfort level with different programming languages and their ability to use them in past projects. It is asking them to explain their comfort level and provide examples of how they have used them in previous projects."
    },
    {
      "text": "How do you prioritize tasks and manage your time when working on multiple projects?",
      "assessment": "This question is assessing the candidate's ability to prioritize tasks and manage their time when working on multiple projects. It is asking them to explain their strategies and provide examples of how they have achieved this in previous projects."
    },
    {
      "text": "Can you provide an example of a challenging problem you faced in software development and how you solved it?",
      "assessment": "This question is assessing the candidate's ability to solve challenging problems in software development. It is asking them to explain their strategies and provide examples of how they have solved challenging problems in previous projects."
    },
    {
      "text": "How do you collaborate with product teams to ensure alignment on project scope?",
      "assessment": "This question is assessing the candidate's ability to collaborate with product teams to ensure alignment on project scope. It is asking them to explain their strategies and provide examples of how they have achieved this in previous projects."
    }
  ]
} 